In [17]:
x = [[180,80,44], [177,70,43],[160,60,38],[154,54,37],[166,65,40],[190,90,47],[175,64,39],[177,70,40],[159,55,37],[171,75,42],[181,85,43]] 
y = {'Person' :['male','male','female','female','male','male','female','female','female','male','male']}
#take data and create data frame

In [18]:
type(y)

dict

In [19]:
import pandas as pd

In [20]:
df1 = pd.DataFrame(x)#divide input and output

In [21]:
df1#input

      0   1   2
0   180  80  44
1   177  70  43
2   160  60  38
3   154  54  37
4   166  65  40
5   190  90  47
6   175  64  39
7   177  70  40
8   159  55  37
9   171  75  42
10  181  85  43

In [22]:
df2 = pd.DataFrame(y)#data frame is a method that can be called to make datframes when needed

In [23]:
df2#output

    Person
0     male
1     male
2   female
3   female
4     male
5     male
6   female
7   female
8   female
9     male
10    male

In [24]:
df = df1.join(df2)#combining dataframe
df

      0   1   2  Person
0   180  80  44    male
1   177  70  43    male
2   160  60  38  female
3   154  54  37  female
4   166  65  40    male
5   190  90  47    male
6   175  64  39  female
7   177  70  40  female
8   159  55  37  female
9   171  75  42    male
10  181  85  43    male

In [25]:
x = df.iloc[:,[0,1,2]].values
x

array([[180,  80,  44],
       [177,  70,  43],
       [160,  60,  38],
       [154,  54,  37],
       [166,  65,  40],
       [190,  90,  47],
       [175,  64,  39],
       [177,  70,  40],
       [159,  55,  37],
       [171,  75,  42],
       [181,  85,  43]])

In [1]:
y = df.iloc[:,3].values
y

NameError: name 'df' is not defined

In [27]:
from sklearn.linear_model import LogisticRegression

In [32]:
model = LogisticRegression()
model.fit(x,y)
y_pred = model.predict([[178, 60, 35]])
y_pred#predict output

array(['female'], dtype=object)